Repository: mezinster/cimbar
Catalog: android/lib/l10n/app_*.arb
Languages: ka, ru, tr, uk

# appTitle
source: CimBar Scanner
ka: CimBar სკანერი
ru: CimBar Сканер
tr: CimBar Tarayıcı
uk: CimBar Сканер

# tabImport
source: Import GIF
ka: GIF იმპორტი
ru: Импорт GIF
tr: GIF İçe Aktar
uk: Імпорт GIF

# tabBinary
source: Import Binary
ka: ბინარული იმპორტი
ru: Импорт бинарного
tr: İkili İçe Aktar
uk: Імпорт бінарного

# tabCamera
source: Camera
ka: კამერა
ru: Камера
tr: Kamera
uk: Камера

# tabSettings
source: About
ka: შესახებ
ru: Настройки
tr: Hakkında
uk: Про додаток

# importTitle
source: Import CimBar GIF
ka: CimBar GIF იმპორტი
ru: Импорт CimBar GIF
tr: CimBar GIF İçe Aktar
uk: Імпорт CimBar GIF

# importBinaryTitle
source: Import Binary File
ka: ბინარული ფაილის იმპორტი
ru: Импорт бинарного файла
tr: İkili Dosya İçe Aktar
uk: Імпорт бінарного файлу

# cameraTitle
source: Camera Scanner
ka: კამერის სკანერი
ru: Сканер камеры
tr: Kamera Tarayıcı
uk: Сканер камери

# settingsTitle
source: About
ka: შესახებ
ru: Настройки
tr: Hakkında
uk: Про додаток

source: Select File
ka: ფაილის არჩევა
ru: Выбрать файл
tr: Dosya Seç
uk: Вибрати файл

# dropFileHere
source: Tap to select or drop a file here
ka: შეხებით აირჩიეთ ან გადმოიტანეთ ფაილი აქ
ru: Нажмите для выбора или перетащите файл сюда
tr: Seçmek için dokunun veya dosyayı buraya bırakın
uk: Натисніть для вибору або перетягніть файл сюди

# selectGifFile
source: Select a CimBar GIF file to decode
ka: აირჩიეთ CimBar GIF ფაილი დეკოდირებისთვის
ru: Выберите CimBar GIF файл для декодирования
tr: Çözümlemek için bir CimBar GIF dosyası seçin
uk: Виберіть CimBar GIF файл для декодування

# selectBinaryFile
source: Select a binary file from C++ scanner
ka: აირჩიეთ ბინარული ფაილი C++ სკანერიდან
ru: Выберите бинарный файл из C++ сканера
tr: C++ tarayıcıdan bir ikili dosya seçin
uk: Виберіть бінарний файл з C++ сканера

source: Passphrase
ka: პაროლი
ru: Пароль
tr: Parola
uk: Пароль

# passphraseHint
source: Enter decryption passphrase
ka: შეიყვანეთ გაშიფვრის პაროლი
ru: Введите пароль для расшифровки
tr: Şifre çözme parolasını girin
uk: Введіть пароль для розшифрування

# passphraseRequired
source: Passphrase is required
ka: პაროლი აუცილებელია
ru: Требуется пароль
tr: Parola gerekli
uk: Потрібен пароль

source: Decode
ka: დეკოდირება
ru: Декодировать
tr: Çöz
uk: Декодувати

source: Decoding...
ka: დეკოდირება...
ru: Декодирование...
tr: Çözümleniyor...
uk: Декодування...

source: Cancel
ka: გაუქმება
ru: Отмена
tr: İptal
uk: Скасувати

# progressParsingGif
source: Parsing GIF...
ka: GIF-ის ანალიზი...
ru: Разбор GIF...
tr: GIF ayrıştırılıyor...
uk: Розбір GIF...

# progressDecodingFrames
source: Decoding frames...
ka: კადრების დეკოდირება...
ru: Декодирование кадров...
tr: Kareler çözümleniyor...
uk: Декодування кадрів...

# progressDecodingFrame
source: Decoding frame {current}/{total}
ka: კადრის დეკოდირება {current}/{total}
ru: Декодирование кадра {current}/{total}
tr: Kare çözümleniyor {current}/{total}
uk: Декодування кадру {current}/{total}

# progressReedSolomon
source: Reed-Solomon decoding...
ka: რიდ-სოლომონის დეკოდირება...
ru: Декодирование Рида-Соломона...
tr: Reed-Solomon çözümleme...
uk: Декодування Ріда-Соломона...

# progressDecrypting
source: Decrypting...
ka: გაშიფვრა...
ru: Расшифровка...
tr: Şifre çözülüyor...
uk: Розшифрування...

# decodeSuccess
source: Successfully decoded!
ka: წარმატებით დეკოდირდა!
ru: Успешно декодировано!
tr: Başarıyla çözümlendi!
uk: Успішно декодовано!

# decodedFile
source: File: {filename}
ka: ფაილი: {filename}
ru: Файл: {filename}
tr: Dosya: {filename}
uk: Файл: {filename}

# decodedSize
source: Size: {size}
ka: ზომა: {size}
ru: Размер: {size}
tr: Boyut: {size}
uk: Розмір: {size}

source: Save File
ka: ფაილის შენახვა
ru: Сохранить файл
tr: Dosyayı Kaydet
uk: Зберегти файл

source: Share File
ka: ფაილის გაზიარება
ru: Поделиться файлом
tr: Dosyayı Paylaş
uk: Поділитися файлом

# fileSaved
source: File saved successfully
ka: ფაილი წარმატებით შეინახა
ru: Файл успешно сохранён
tr: Dosya başarıyla kaydedildi
uk: Файл успішно збережено

# errorGeneric
source: An error occurred
ka: მოხდა შეცდომა
ru: Произошла ошибка
tr: Bir hata oluştu
uk: Сталася помилка

# errorDecryption
source: Decryption failed â€” wrong passphrase or corrupted data
ka: გაშიფვრა ვერ მოხერხდა — არასწორი პაროლი ან დაზიანებული მონაცემები
ru: Ошибка расшифровки — неверный пароль или повреждённые данные
tr: Şifre çözme başarısız — yanlış parola veya bozuk veri
uk: Помилка розшифрування — неправильний пароль або пошкоджені дані

# errorInvalidGif
source: Invalid or unsupported GIF file
ka: არასწორი ან მხარდაუჭერელი GIF ფაილი
ru: Недопустимый или неподдерживаемый GIF файл
tr: Geçersiz veya desteklenmeyen GIF dosyası
uk: Недійсний або непідтримуваний GIF файл

# errorNoFrames
source: GIF contains no frames
ka: GIF არ შეიცავს კადრებს
ru: GIF не содержит кадров
tr: GIF kare içermiyor
uk: GIF не містить кадрів

# errorFileTooLarge
source: File is too large to process
ka: ფაილი ძალიან დიდია დასამუშავებლად
ru: Файл слишком большой для обработки
tr: Dosya işlemek için çok büyük
uk: Файл занадто великий для обробки

# cameraScanInstruction
source: Take a photo of a CimBar barcode to decode it
ka: გადაუღეთ ფოტო CimBar შტრიხკოდს დეკოდირებისთვის
ru: Сфотографируйте штрих-код CimBar для декодирования
tr: Çözümlemek için bir CimBar barkodunun fotoğrafını çekin
uk: Сфотографуйте штрих-код CimBar для декодування

# cameraTakePhoto
source: Take Photo
ka: ფოტოს გადაღება
ru: Сделать фото
tr: Fotoğraf Çek
uk: Зробити фото

# cameraFromGallery
source: Gallery
ka: გალერეა
ru: Галерея
tr: Galeri
uk: Галерея

# cameraRetake
source: Retake
ka: ხელახლა გადაღება
ru: Переснять
tr: Yeniden Çek
uk: Перезняти

# progressLocatingBarcode
source: Locating barcode...
ka: შტრიხკოდის ძიება...
ru: Поиск штрих-кода...
tr: Barkod aranıyor...
uk: Пошук штрих-коду...

# progressDetectingFrameSize
source: Detecting frame size...
ka: კადრის ზომის განსაზღვრა...
ru: Определение размера кадра...
tr: Kare boyutu algılanıyor...
uk: Визначення розміру кадру...

# errorBarcodeNotFound
source: No barcode found in photo
ka: ფოტოში შტრიხკოდი ვერ მოიძებნა
ru: Штрих-код не найден на фото
tr: Fotoğrafta barkod bulunamadı
uk: Штрих-код не знайдено на фото

# errorNoFrameSizeMatch
source: Could not decode barcode at any supported frame size
ka: შტრიხკოდის დეკოდირება ვერ მოხერხდა არცერთ მხარდაჭერილ კადრის ზომაზე
ru: Не удалось декодировать штрих-код ни при одном поддерживаемом размере кадра
tr: Desteklenen hiçbir kare boyutunda barkod çözümlenemedi
uk: Не вдалося декодувати штрих-код при жодному підтримуваному розмірі кадру

source: Language
ka: ენა
ru: Язык
tr: Dil
uk: Мова

source: System Default
ka: სისტემის ნაგულისხმევი
ru: Системный по умолчанию
tr: Sistem Varsayılanı
uk: Системна за замовчуванням

source: About
ka: შესახებ
ru: О приложении
tr: Hakkında
uk: Про додаток

# aboutDescription
source: CimBar Scanner decodes Color Icon Matrix Barcodes. Compatible with the CimBar web encoder at nfcarchiver.com/cimbar.
ka: CimBar სკანერი დეკოდირებს ფერადი ხატულების მატრიცულ შტრიხკოდებს. თავსებადია CimBar ვებ-კოდირებასთან: nfcarchiver.com/cimbar.
ru: CimBar Сканер декодирует цветные матричные штрих-коды. Совместим с веб-кодировщиком CimBar на nfcarchiver.com/cimbar.
tr: CimBar Tarayıcı, Renkli Simge Matris Barkodlarını çözümler. nfcarchiver.com/cimbar adresindeki CimBar web kodlayıcı ile uyumludur.
uk: CimBar Сканер декодує кольорові матричні штрих-коди. Сумісний з веб-кодувальником CimBar на nfcarchiver.com/cimbar.

# webAppLabel
source: Web App
ka: ვებ-აპლიკაცია
ru: Веб-приложение
tr: Web Uygulaması
uk: Веб-додаток

# version
source: Version {version}
ka: ვერსია {version}
ru: Версия {version}
tr: Sürüm {version}
uk: Версія {version}

# liveScanButton
source: Live Scan
ka: პირდაპირი სკანირება
ru: Живое сканирование
tr: Canlı Tarama
uk: Живе сканування

# liveScanProgress
source: Scanning... {captured}/{total} frames captured
ka: სკანირება... {captured}/{total} კადრი დაფიქსირდა
ru: Сканирование... {captured}/{total} кадров захвачено
tr: Taranıyor... {captured}/{total} kare yakalandı
uk: Сканування... {captured}/{total} кадрів захоплено

# liveScanSearching
source: Scanning for CimBar barcode...
ka: CimBar შტრიხკოდის ძიება...
ru: Поиск штрих-кода CimBar...
tr: CimBar barkodu aranıyor...
uk: Пошук штрих-коду CimBar...

# liveScanComplete
source: All frames captured!
ka: ყველა კადრი დაფიქსირდა!
ru: Все кадры захвачены!
tr: Tüm kareler yakalandı!
uk: Усі кадри захоплено!

# liveScanError
source: Scan failed
ka: სკანირება ვერ მოხერხდა
ru: Сканирование не удалось
tr: Tarama başarısız
uk: Сканування не вдалося

# cameraPermissionDenied
source: Camera permission is required for live scanning
ka: პირდაპირი სკანირებისთვის საჭიროა კამერის ნებართვა
ru: Для живого сканирования требуется разрешение камеры
tr: Canlı tarama için kamera izni gerekli
uk: Для живого сканування потрібен дозвіл камери

# noCameraAvailable
source: No camera available on this device
ka: ამ მოწყობილობაზე კამერა მიუწვდომელია
ru: На этом устройстве нет доступной камеры
tr: Bu cihazda kamera yok
uk: На цьому пристрої немає доступної камери

# liveScanFramesAnalyzed
source: {count} frames analyzed
ka: {count} კადრი გაანალიზებულია
ru: {count} кадров проанализировано
tr: {count} kare analiz edildi
uk: {count} кадрів проаналізовано

# tabFiles
source: Files
ka: ფაილები
tr: Dosyalar
uk: Файли

# filesTitle
source: Decoded Files
ka: ფაილები
tr: Dosyalar
uk: Декодовані файли

# noFilesYet
source: No decoded files yet
ka: ფაილები ჯერ არ არის
tr: Henüz dosya yok
uk: Ще немає файлів

source: Delete
ka: წაშლა
tr: Sil
uk: Видалити

# deleteFileTitle
source: Delete File
ka: ფაილის წაშლა
tr: Dosyayı Sil
uk: Видалити файл

# deleteFileConfirm
source: Delete {filename}?
ka: წაიშალოს {filename}?
tr: {filename} silinsin mi?
uk: Видалити {filename}?

source: File deleted
ka: ფაილი წაიშალა
tr: Dosya silindi
uk: Файл видалено

source: Privacy Policy
ka: კონფიდენციალურობის პოლიტიკა
tr: Gizlilik Politikası
uk: Політика конфіденційності

# licenseInfo
source: MIT License
ka: MIT ლიცენზია
tr: MIT Lisansı
uk: Ліцензія MIT

source: Source Code
ka: საწყისი კოდი
tr: Kaynak Kodu
uk: Вихідний код
